IDEA StatiCa Open Model
ApplyConnTemplateSetting Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Defaults which are used for applying template
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.ApplyConnTemplateSetting
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ApplyConnTemplateSetting
Public Class ApplyConnTemplateSetting
public ref class ApplyConnTemplateSetting
The ApplyConnTemplateSetting type exposes the following members.
Constructors
Name | Description
ApplyConnTemplateSetting
Initializes a new instance of the ApplyConnTemplateSetting class
Top
Properties
Name | Description
DefaultBoltAssemblyID
 ID of the bolt assembly which will be used as default (it must exists in the project)
DefaultCleatCrossSectionID
 ID of the cross section for cleats which will be used as default (it must exists in the project)
DefaultConcreteMaterialID
 ID of the material concrete which will be used as default (it must exists in the project)
DefaultStiffMemberCrossSectionID
 ID of the cross-section for stiffening members concrete which will be used as default (it must exists in the project)
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace